0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

$../BC!turbulent

dimensions [0 2 -2 0 0 0 0];

internalField uniform $k;


boundaryField
{

	#includeEtc "caseDicts/setConstraintTypes"

	inlet
	{
		type	turbulentIntensityKineticEnergyInlet;
		intensity	$intensity;
		value	uniform $k;
	}

	outlet
	{
		type	inletOutlet;
		inletValue	uniform $k;
		value	uniform	$k;
	}

	wall
	{
		type	kLowReWallFunction;
		value	uniform $kWall;
	}
	
	NCC
	{
		type	zeroGradient;
	}
}
