0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

$../BC!turbulent

dimensions [0 2 -1 0 0 0 0];

internalField uniform 0;


boundaryField
{
	#includeEtc "caseDicts/setConstraintTypes"

	inlet
	{
		type	calculated;
		value	$internalField;
	}

	outlet
	{
		type	calculated;
		value	$internalField;
	}

	wall
	{
		type	nutLowReWallFunction;
		value	$internalField;
	}

	NCC
	{
		type	zeroGradient;
	}
}
