0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

$../BC!turbulent

dimensions [0 0 -1 0 0 0 0];

internalField uniform $omega;


boundaryField
{	
	#includeEtc "caseDicts/setConstraintTypes"

	inlet
	{
		type	turbulentMixingLengthFrequencyInlet;
		// type	fixedValue;
		mixingLength	$mixingLength;
		value	$internalField;
	}

	outlet
	{
		type	inletOutlet;
		inletValue	$internalField;
		value	$internalField;
	}

	wall
	{
		type	omegaWallFunction;
		value	$internalField;
	}
	
	NCC
	{
		type	zeroGradient;
	}
}
