0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

$../BC!flow

dimensions [0 2 -2 0 0 0 0];

internalField uniform $p;


boundaryField
{
	#includeEtc "caseDicts/setConstraintTypes"

	inlet
	{
    	type           zeroGradient;
	}

	outlet
	{
		type	fixedValue;
		value	$internalField;
	}

	wall
	{
		type	zeroGradient;
	}

	NCC
	{
		type	zeroGradient;
	}
}
