constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/
$../BC!turbulent


simulationType $simulationType;

RAS
{
	model $model;

	turbulence on;

	printCoeffs on;
	
}
